In [5]:
import sys
import os
import streamlit as st
import requests
import pandas as pd
import datetime
import matplotlib.pyplot as plt
import tempfile
import sqlite3

from budget_functions import *

# # Was hoping to put the site online...
# script_directory = os.path.dirname(os.path.abspath(__file__))
# # Add the project root directory to sys.path
# project_root_directory = os.path.join(script_directory, '..')
# sys.path.append(project_root_directory)

In [19]:
def setup(file):
    # creating file path
    sqlfile = '/Users/antonis/Documents/DS/' + file
    # Create a SQL connection to our SQLite database + cursor
    con = sqlite3.connect(sqlfile)
    cur = con.cursor()

    # reading all table names
    # table_list = [a for a in cur.execute("SELECT name FROM sqlite_master WHERE type = 'table'")]
    # here is your table list
    # print(table_list)

    df = pd.read_sql_query('SELECT s_date, s_time, s_where, s_cate, s_subcate, s_price FROM spendinglist', con)
    df_type = df.astype({'s_date':'datetime64[ns]', 's_time':'datetime64[ns]', 's_where':'string', 's_price':'float', 's_cate':'float', 's_subcate':'float'})
    df_type['s_time'] = df_type['s_time'].dt.strftime('%H:%M:%S')
    #Add year and month columns
    df_type['Month'] = df_type['s_date'].dt.month
    df_type['Year'] = df_type['s_date'].dt.year

    con.close()
    return df_type

In [20]:
setup("clevmoney_102423_125727_auto.db")

,s_date,s_time,s_where,s_cate,s_subcate,s_price,Month,Year
0,2022-05-02,15:13:00,Tesco,47.0,56.0,9.70,5,2022
1,2022-05-02,15:14:00,Santander,21.0,49.0,90.00,5,2022
2,2022-05-03,15:37:00,Tesco,1.0,50.0,3.20,5,2022
3,2022-05-03,22:19:00,RyanAir (Amsterdam),51.0,54.0,90.82,5,2022
4,2022-05-03,22:19:00,EasyJet (Poland),51.0,54.0,126.66,5,2022
...,...,...,...,...,...,...,...,...
1669,2023-10-21,15:50:00,Runners Needs,18.0,19.0,29.99,10,2023
1670,2023-10-21,15:53:00,Sainsbury,47.0,57.0,13.20,10,2023
1671,2023-10-21,19:03:00,Runners Needs,18.0,19.0,180.00,10,2023
1672,2023-10-21,00:00:00,Roman Road,47.0,118.0,1.74,10,2023
1673,2023-10-21,00:00:00,Train,21.0,22.0,7.30,10,2023